app/views/scores/new.html.erb

SELECT "games".* FROM "games"
---
  <%= bootstrap_form_for @score, url: game_scores_path do |f| %>
    <%= f.collection_select(:game_id, Game.all, :id, :name, { include_blank:true}) %>