app/views/welcome/index.html.erb

SELECT "group_memberships".* FROM "group_memberships" WHERE "group_memberships"."group_id" = ?  [["group_id", 1]]
SELECT "groups".* FROM "groups"
---
            <ul>
              <% g.group_memberships.each do |gm| %>