app/controllers/groups_controller.rb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @group = Group.find(params[:id])