app/controllers/welcome_controller.rb

SELECT "games".* FROM "games"
SELECT "groups".* FROM "groups"
---
  def index
    @games = Game.all
    @groups = Group.all